brew "aspell"
brew "automake"
brew "openssl@3"
brew "bat"
brew "bear"
brew "clang-format"
brew "cloc"
brew "cmake"
brew "cppcheck"
brew "curl"
brew "docker"
brew "dos2unix"
brew "fish"
brew "gcc"
brew "git"
brew "gnu-tar"
brew "htop"
brew "hugo"
brew "libtool"
brew "libusb"
brew "lima"
brew "llvm"
brew "mold"
brew "neofetch"
brew "neovim"
brew "ninja"
brew "node"
brew "onefetch"
brew "openssh"
brew "pkg-config"
brew "poetry"
brew "pyenv"
brew "tcl-tk"
brew "texinfo"
brew "the_silver_searcher"
brew "tig"
brew "tldr"
brew "tmux"
brew "tree"
brew "watch"
brew "wget"
brew "yarn"
cask "discord"
cask "flutter"
cask "gcc-arm-embedded"
cask "istat-menus"
cask "iterm2"
cask "karabiner-elements"
cask "mactex"
cask "playcover-community"
cask "qmk-toolbox"
cask "raycast"
cask "rectangle"
cask "vchewing"
cask "visual-studio-code"
cask "wezterm"
cask "xquartz"
vscode "aaron-bond.better-comments"
vscode "budparr.language-hugo-vscode"
vscode "bungcip.better-toml"
vscode "formulahendry.code-runner"
vscode "fssl.nearly-black"
vscode "GitHub.copilot"
vscode "hediet.vscode-drawio"
vscode "holmescn.vscode-wordcount-cjk"
vscode "James-Yu.latex-workshop"
vscode "jeff-hykin.better-cpp-syntax"
vscode "josetr.cmake-language-support-vscode"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "mathematic.vscode-latex"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "MS-CEINTL.vscode-language-pack-zh-hant"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-serial-monitor"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-vsliveshare.vsliveshare-pack"
vscode "pbkit.vscode-pbkit"
vscode "ritwickdey.LiveServer"
vscode "searKing.preview-vscode"
vscode "Stephen-Hamilton-C.black-plus-material"
vscode "trond-snekvik.simple-rst"
vscode "twxs.cmake"
vscode "vsciot-vscode.vscode-arduino"
vscode "yzhang.markdown-all-in-one"
