tap "windwords/vchewing"
brew "openssl@3"
brew "bat"
brew "bear"
brew "btop"
brew "clang-format"
brew "cloc"
brew "cmake"
brew "colima"
brew "docker-compose"
brew "cppcheck"
brew "curl"
brew "docker"
brew "dos2unix"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fish"
brew "gcc"
brew "git"
brew "gnu-tar"
brew "hugo"
brew "llvm"
brew "mas"
brew "mold"
brew "neovim"
brew "ninja"
brew "node"
brew "onefetch"
brew "openssh"
brew "poetry"
brew "pyenv"
brew "ripgrep"
brew "tig"
brew "tldr"
brew "tmux"
brew "tpm"
brew "typst"
brew "watch"
brew "wget"
brew "zoxide"
cask "alacritty"
cask "brave-browser"
cask "flutter"
cask "ghostty"
cask "karabiner-elements"
cask "keepassxc"
cask "qmk-toolbox"
cask "raycast"
cask "rectangle"
cask "stats"
cask "telegram"
cask "vchewing"
cask "vesktop"
cask "visual-studio-code"
mas "LINE", id: 539883307
mas "Messenger", id: 1480068668
mas "Steam", id: 413730677
mas "Telegram", id: 747648890
