brew "bat"
brew "bear"
brew "btop"
brew "chezmoi"
brew "clang-format"
brew "cloc"
brew "cmake"
brew "container", restart_service: :changed if Hardware::CPU.arm? && !ENV["CI"]
brew "container-compose" if Hardware::CPU.arm? && !ENV["CI"]
brew "cppcheck"
brew "curl"
brew "dos2unix"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fish"
brew "gh"
brew "git"
brew "glab"
brew "gnu-tar"
brew "hugo"
brew "lazygit"
brew "llvm"
brew "mold"
brew "neovim"
brew "ninja"
brew "node"
brew "onefetch"
brew "openssh"
brew "ripgrep"
brew "tig"
brew "tldr"
brew "tmux"
brew "typst"
brew "uv"
brew "watch"
brew "wget"
brew "zellij"
brew "zoxide"
cask "brave-browser"
cask "claude-code@latest"
cask "flutter"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "karabiner-elements"
cask "keepassxc"
cask "kitty"
cask "moonlight"
cask "nikitabobko/tap/aerospace", trusted: true
cask "qmk-toolbox"
cask "raycast"
cask "signal"
cask "stats"
cask "telegram"
cask "vesktop"
cask "visual-studio-code"
cask "windwords/vchewing/vchewing", trusted: true
