tap "windwords/vchewing"
brew "aspell"
brew "automake"
brew "openssl@3"
brew "bat"
brew "bear"
brew "clang-format"
brew "cloc"
brew "cmake"
brew "cppcheck"
brew "curl"
brew "docker"
brew "dos2unix"
brew "eza"
brew "fastfetch"
brew "fish"
brew "gcc"
brew "git"
brew "gnu-tar"
brew "htop"
brew "hugo"
brew "llvm"
brew "mold"
brew "neovim"
brew "ninja"
brew "node"
brew "onefetch"
brew "openssh"
brew "podman"
brew "poetry"
brew "pyenv"
brew "the_silver_searcher"
brew "tig"
brew "tldr"
brew "tmux"
brew "tpm"
brew "tree"
brew "watch"
brew "wget"
cask "alacritty"
cask "brave-browser"
cask "flutter"
cask "istat-menus"
cask "karabiner-elements"
cask "mactex"
cask "qmk-toolbox"
cask "raycast"
cask "rectangle"
cask "telegram"
cask "vchewing"
cask "vesktop"
cask "visual-studio-code"
